```module.terraform-state-bucket[0].aws_s3_bucket.this[0]: Refreshing state... [id=tfstate-production-poc]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0df15900496e56eda]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-093a4581f8a041ef1]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::410235571384:policy/eks-prod-us-west-2-elb-sl-role-creation20210203140055981100000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=eks-prod-us-west-220210203022226639400000001]
module.terraform-state-locks[0].aws_dynamodb_table.this[0]: Refreshing state... [id=tfstate-production-locks]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=eks-prod-us-west-220210203022226639400000001-20210203022227418000000005]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=eks-prod-us-west-220210203022226639400000001-20210203022227388500000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=eks-prod-us-west-220210203022226639400000001-20210203022227393000000004]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=eks-prod-us-west-220210203022226639400000001-20210203140058811800000004]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0bd0fbcabf75cb210]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08c1e6da56a75a68e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07c213d83a5957592]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cd8df96bb63f74c2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-036bbc8f32f9aa0f5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0375d8d537eaf0c64]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f22a2505ba7e2977]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0790e2b9bceffb005]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b9ae911e9dc40e8b]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0782879f011939efc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09f3db1561d624f32]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08c1e6da56a75a68e1080289494]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-4189492169]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-029a040519dec2602]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08b87d8054b5817ab]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ba22cc6d96b32180]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-2949997914]
module.terraform-state-bucket[0].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=tfstate-production-poc]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f23f1c01a910977b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0af2a2a9666108de7]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-04752cbf92b5f5bb8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09582f53824a1efca]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-2428025868]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3785768767]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-3033933457]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-546745685]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-prod-us-west-2]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-036bbc8f32f9aa0f51080289494]
module.eks.null_resource.wait_for_cluster[0]: Refreshing state... [id=5254166330893456363]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=eks-prod-us-west-220210203023519611900000009]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::410235571384:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/3875067BC24872486BB1B657DC07A19F]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=555fea62a2e622f5557245923817c64a824f15ea]
module.eks.aws_iam_instance_profile.workers_launch_template[0]: Refreshing state... [id=eks-prod-us-west-22021020302352014220000000a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=eks-prod-us-west-220210203023519611900000009-20210203140058823300000005]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=eks-prod-us-west-220210203023519611900000009-20210203140058359800000003]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=eks-prod-us-west-220210203023519611900000009-20210203140056216800000002]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_launch_template.workers_launch_template[0]: Refreshing state... [id=lt-0f0f5593d7003b63a]
module.eks.random_pet.workers_launch_template[0]: Refreshing state... [id=evident-sawfly]
module.eks.aws_autoscaling_group.workers_launch_template[0]: Refreshing state... [id=eks-prod-us-west-2-spot-main20210203140103399200000008]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.template_file.launch_template_userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      ~ id       = "0026f7c23b45d05fbc19b95592b917c9464f61206a8c052303d7b2f755a9c2a2" -> (known after apply)
      ~ rendered = <<-EOT
            #!/bin/bash -e
            
            # Allow user supplied pre userdata code
            
            
            # Bootstrap and join the cluster
            /etc/eks/bootstrap.sh --b64-cluster-ca 'LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1ESXdNekF5TXpBME5sb1hEVE14TURJd01UQXlNekEwTmxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTm9KCk1UUGdCSzhrQkRMVmEzVjdrV0R4VFVocW4xWk42bXRobEdZWWQvRUJUSnJNcS9mUVVPMzF4OTdnbjU3V1BNdGoKeCtJR2g3VmRDU05MUU5NOXFyUTA2eU9LZko1SXJQTVJUUml5Rmxsci95anYrTkc3TjgwQmFhZGVUWm5QUzNxaQpubFJmU0c5UWhFQVcxb1hNNCtnT3BCbmh6ZU5WaGlIYVQvOFRUNVRPRGF0b1BTYXZla1VDOFZiYzB5MmtMVzJhCnJJZ2p0VmJiTEhDTnZpcXpVdzZqS09aditHNUFiS2E1NVBGdjMyQjBVSll4OUdWeGs3VzQrRFdHcGlBQU1qOGMKNjl1dGh0OGR0QkFjenZIMEZ4S0lUMEFkY0J3M3R1RVJJYkJ0V3hreFpIMmlTbXZuVFBUUDUzQTNKOXAzcjhTVwp0cWVoM2duV2tTTGtITU04b1pFQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFGQ3hJcFk3d1V1cUpFRDl1aDN2MkltV1VCRkwKQnYwUU9RekxyOVRnNU1sb2kvNjVzTUZ6NHN4MzdWM3NjaDhqWGJHN0dkQkN0TENFZnBIN1ZHYkVSKy9sdDU2awowREhJTmVsNi9yNExrMFpFV1l6UGpMdnROSGlxNEtmMlI5N3RMbndUekcrN0FVZFB3YXNPWkRZZjBuTk1IalBkCmVicGpKMDYxQzZqb1BsZ0VXK3c3NGJDeFROQnYvdzNleTNzakJ3MDdEL2VheFVLRXJjbmIrdFBpNFUvaTQzUkwKYXVEMzlrQTdEaDJGclorNm9rU3lrU1hwa3BFMmV3ZzRRWXMzbmtlbEtOejFzWUJuejErYmx5SFQ3bWxWOXduRgorUTNUMC9lV25GaGlIeVFEMzVEWXpybXd1SjhQSmNNNjdWaklaek1DK0JIWFU1TkVvQ09YaGVQczBZYz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=' --apiserver-endpoint 'https://3875067BC24872486BB1B657DC07A19F.gr7.us-west-2.eks.amazonaws.com'  --kubelet-extra-args "--node-labels=node.kubernetes.io/lifecycle=spot" 'eks-prod-us-west-2'
            
            # Allow user supplied userdata code
            
        EOT -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_launch_template.workers_launch_template[0] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        id                      = "lt-0f0f5593d7003b63a"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "eks-prod-us-west-2-spot-main20210203140102034500000006"
        tags                    = {}
      ~ user_data               = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VONVJFTkRRV0pEWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFU1hkTmVrRjVUWHBCTUU1c2IxaEVWRTE0VFVSSmQwMVVRWGxOZWtFd1RteHZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVG05S0NrMVVVR2RDU3poclFrUk1WbUV6VmpkclYwUjRWRlZvY1c0eFdrNDJiWFJvYkVkWldXUXZSVUpVU25KTmNTOW1VVlZQTXpGNE9UZG5ialUzVjFCTmRHb0tlQ3RKUjJnM1ZtUkRVMDVNVVU1Tk9YRnlVVEEyZVU5TFprbzFTWEpRVFZKVVVtbDVSbXhzY2k5NWFuWXJUa2MzVGpnd1FtRmhaR1ZVV201UVV6TnhhUXB1YkZKbVUwYzVVV2hGUVZjeGIxaE5OQ3RuVDNCQ2JtaDZaVTVXYUdsSVlWUXZPRlJVTlZSUFJHRjBiMUJUWVhabGExVkRPRlppWXpCNU1tdE1WekpoQ25KSloycDBWbUppVEVoRFRuWnBjWHBWZHpacVMwOWFkaXRITlVGaVMyRTFOVkJHZGpNeVFqQlZTbGw0T1VkV2VHczNWelFyUkZkSGNHbEJRVTFxT0dNS05qbDFkR2gwT0dSMFFrRmplblpJTUVaNFMwbFVNRUZrWTBKM00zUjFSVkpKWWtKMFYzaHJlRnBJTW1sVGJYWnVWRkJVVURVelFUTktPWEF6Y2poVFZ3cDBjV1ZvTTJkdVYydFRUR3RJVFUwNGIxcEZRMEYzUlVGQllVMXFUVU5GZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRa0ZHUTNoSmNGazNkMVYxY1VwRlJEbDFhRE4yTWtsdFYxVkNSa3dLUW5Zd1VVOVJla3h5T1ZSbk5VMXNiMmt2TmpWelRVWjZOSE40TXpkV00zTmphRGhxV0dKSE4wZGtRa04wVEVORlpuQklOMVpIWWtWU0t5OXNkRFUyYXdvd1JFaEpUbVZzTmk5eU5FeHJNRnBGVjFsNlVHcE1kblJPU0dseE5FdG1NbEk1TjNSTWJuZFVla2NyTjBGVlpGQjNZWE5QV2tSWlpqQnVUazFJYWxCa0NtVmljR3BLTURZeFF6WnFiMUJzWjBWWEszYzNOR0pEZUZST1FuWXZkek5sZVROemFrSjNNRGRFTDJWaGVGVkxSWEpqYm1JcmRGQnBORlV2YVRRelVrd0tZWFZFTXpsclFUZEVhREpHY2xvck5tOXJVM2xyVTFod2EzQkZNbVYzWnpSUldYTXpibXRsYkV0T2VqRnpXVUp1ZWpFcllteDVTRlEzYld4V09YZHVSZ29yVVROVU1DOWxWMjVHYUdsSWVWRkVNelZFV1hweWJYZDFTamhRU21OTk5qZFdha2xhZWsxREswSklXRlUxVGtWdlEwOVlhR1ZRY3pCWll6MEtMUzB0TFMxRlRrUWdRMFZTVkVsR1NVTkJWRVV0TFMwdExRbz0nIC0tYXBpc2VydmVyLWVuZHBvaW50ICdodHRwczovLzM4NzUwNjdCQzI0ODcyNDg2QkIxQjY1N0RDMDdBMTlGLmdyNy51cy13ZXN0LTIuZWtzLmFtYXpvbmF3cy5jb20nICAtLWt1YmVsZXQtZXh0cmEtYXJncyAiLS1ub2RlLWxhYmVscz1ub2RlLmt1YmVybmV0ZXMuaW8vbGlmZWN5Y2xlPXNwb3QiICdla3MtcHJvZC11cy13ZXN0LTInCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQoK" -> (known after apply)
        # (9 unchanged attributes hidden)








        # (9 unchanged blocks hidden)
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://3875067BC24872486BB1B657DC07A19F.gr7.us-west-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1ESXdNekF5TXpBME5sb1hEVE14TURJd01UQXlNekEwTmxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTm9KCk1UUGdCSzhrQkRMVmEzVjdrV0R4VFVocW4xWk42bXRobEdZWWQvRUJUSnJNcS9mUVVPMzF4OTdnbjU3V1BNdGoKeCtJR2g3VmRDU05MUU5NOXFyUTA2eU9LZko1SXJQTVJUUml5Rmxsci95anYrTkc3TjgwQmFhZGVUWm5QUzNxaQpubFJmU0c5UWhFQVcxb1hNNCtnT3BCbmh6ZU5WaGlIYVQvOFRUNVRPRGF0b1BTYXZla1VDOFZiYzB5MmtMVzJhCnJJZ2p0VmJiTEhDTnZpcXpVdzZqS09aditHNUFiS2E1NVBGdjMyQjBVSll4OUdWeGs3VzQrRFdHcGlBQU1qOGMKNjl1dGh0OGR0QkFjenZIMEZ4S0lUMEFkY0J3M3R1RVJJYkJ0V3hreFpIMmlTbXZuVFBUUDUzQTNKOXAzcjhTVwp0cWVoM2duV2tTTGtITU04b1pFQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFGQ3hJcFk3d1V1cUpFRDl1aDN2MkltV1VCRkwKQnYwUU9RekxyOVRnNU1sb2kvNjVzTUZ6NHN4MzdWM3NjaDhqWGJHN0dkQkN0TENFZnBIN1ZHYkVSKy9sdDU2awowREhJTmVsNi9yNExrMFpFV1l6UGpMdnROSGlxNEtmMlI5N3RMbndUekcrN0FVZFB3YXNPWkRZZjBuTk1IalBkCmVicGpKMDYxQzZqb1BsZ0VXK3c3NGJDeFROQnYvdzNleTNzakJ3MDdEL2VheFVLRXJjbmIrdFBpNFUvaTQzUkwKYXVEMzlrQTdEaDJGclorNm9rU3lrU1hwa3BFMmV3ZzRRWXMzbmtlbEtOejFzWUJuejErYmx5SFQ3bWxWOXduRgorUTNUMC9lV25GaGlIeVFEMzVEWXpybXd1SjhQSmNNNjdWaklaek1DK0JIWFU1TkVvQ09YaGVQczBZYz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
              name: eks_eks-prod-us-west-2
            
            contexts:
            - context:
                cluster: eks_eks-prod-us-west-2
                user: eks_eks-prod-us-west-2
              name: eks_eks-prod-us-west-2
            
            current-context: eks_eks-prod-us-west-2
            
            users:
            - name: eks_eks-prod-us-west-2
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "eks-prod-us-west-2"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_eks-prod-us-west-2"
      + id                   = (known after apply)
    }

  # module.eks.random_pet.workers_launch_template[0] must be replaced
+/- resource "random_pet" "workers_launch_template" {
      ~ id        = "evident-sawfly" -> (known after apply)
      ~ keepers   = {
          - "lt_name" = "eks-prod-us-west-2-spot-main20210203140102034500000006-1"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.terraform-state-locks[0].aws_dynamodb_table.this[0] will be updated in-place
  ~ resource "aws_dynamodb_table" "this" {
        id             = "tfstate-production-locks"
        name           = "tfstate-production-locks"
      ~ read_capacity  = 0 -> 20
        tags           = {
            "Name" = "tfstate-production-locks"
        }
      ~ write_capacity = 0 -> 20
        # (4 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-093a4581f8a041ef1"
      ~ tags                 = {
          ~ "Environment" = "production" -> "production-poc"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0cd8df96bb63f74c2"
      ~ tags     = {
          ~ "Environment" = "production" -> "production-poc"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0af2a2a9666108de7"
      ~ tags                 = {
          ~ "Environment" = "production" -> "production-poc"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-036bbc8f32f9aa0f5"
      ~ tags             = {
          ~ "Environment" = "production" -> "production-poc"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-08c1e6da56a75a68e"
      ~ tags             = {
          ~ "Environment" = "production" -> "production-poc"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0375d8d537eaf0c64"
      ~ tags                            = {
          ~ "Environment"                     = "production" -> "production-poc"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-07c213d83a5957592"
      ~ tags                            = {
          ~ "Environment"                     = "production" -> "production-poc"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0f22a2505ba7e2977"
      ~ tags                            = {
          ~ "Environment"                     = "production" -> "production-poc"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0b9ae911e9dc40e8b"
      ~ tags                            = {
          ~ "Environment"               = "production" -> "production-poc"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-09f3db1561d624f32"
      ~ tags                            = {
          ~ "Environment"               = "production" -> "production-poc"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0782879f011939efc"
      ~ tags                            = {
          ~ "Environment"               = "production" -> "production-poc"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0df15900496e56eda"
      ~ tags                             = {
          ~ "Environment" = "production" -> "production-poc"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 14 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```